Revit 2024 API
ScheduleDefinition.ClearFields Method
 Removes all fields.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void ClearFields()
Visual Basic
Public Sub ClearFields
Visual C++
public:
void ClearFields()
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace